src/test/resources/data/QBTDCOrderEndpointTest/QBTDC-InvalidOrder.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
    <soap:Header>
        <wsse:Security soap:mustUnderstand="1">
            <wsse:UsernameToken  >
                <wsse:Username>SKYWS</wsse:Username>
                <wsse:Password>iLwt5oSK</wsse:Password>
            </wsse:UsernameToken>
        </wsse:Security>
    </soap:Header>
    <soap:Body>
        <wag:QBTDC xmlns:wag="http://wag.btireland.ie/WAG_WS/">
            <wag:VERSION>1.0</wag:VERSION>
            <wag:ORDER>
                <wag:HEADER>
                    <wag:DATA_CONTRACT_NAME>WAG</wag:DATA_CONTRACT_NAME>
                    <wag:ORIGINATOR_CODE>EXT</wag:ORIGINATOR_CODE>
                    <wag:TRANSACTION_ID>100</wag:TRANSACTION_ID>
                    <wag:DATE_TIME_STAMP>25/05/2022 05:17:28</wag:DATE_TIME_STAMP>
                </wag:HEADER>
                <wag:ORDER_DATA>
                    <wag:OPERATOR_DETAILS>
                        <wag:NAME>SKY</wag:NAME>
                        <wag:CODE>83758</wag:CODE>
                    </wag:OPERATOR_DETAILS>
                    <wag:ORDER_DETAILS>
                        <wag:SYNC_REQUIRED>Yes</wag:SYNC_REQUIRED>
                        <wag:ORDER_NUMBER>AUTOGENERATE</wag:ORDER_NUMBER>
                        <wag:TYPE>QBTDC</wag:TYPE>
                        <wag:APPLICATION_DATE>25/05/2022</wag:APPLICATION_DATE>
                        <!--Optional:-->
                        <wag:PROJECT_KEY>Proj Key</wag:PROJECT_KEY>
                        <!--Optional:-->
                        <wag:OBO>string</wag:OBO>
                        <wag:RECURRING_FREQUENCY>ANNUAL</wag:RECURRING_FREQUENCY>
                    </wag:ORDER_DETAILS>
                    <!--1 or more repetitions:-->
                    <wag:QUOTE_ITEM_REQUEST>
                        <wag:PRODUCT>WEC</wag:PRODUCT>
                        <wag:TERM>5</wag:TERM>
                        <!--Optional:-->
                        <wag:IP>
                            <wag:IP_RANGE>29</wag:IP_RANGE>
                        </wag:IP>
                        <wag:LOGICAL>
                            <wag:ACTION_FLAG>P</wag:ACTION_FLAG>
                            <wag:BANDWIDTH>9000</wag:BANDWIDTH>
                            <wag:PROFILE>PREMIUM_100</wag:PROFILE>
                        </wag:LOGICAL>
                        <!--Optional:-->
                        <wag:OPTICAL_LINK>
                            <wag:ACTION_FLAG>P</wag:ACTION_FLAG>
                            <wag:BANDWIDTH>strin</wag:BANDWIDTH>
                        </wag:OPTICAL_LINK>
                        <wag:A_END>
                            <wag:LOCATION>
                                <wag:EIRCODE>string</wag:EIRCODE>
                            </wag:LOCATION>
                            <wag:ACCESS>
                                <wag:ACTION_FLAG>P</wag:ACTION_FLAG>
                                <!--Optional:-->
                                <wag:ACCESS_SUPPLIER>ANY</wag:ACCESS_SUPPLIER>
                                <wag:BANDWIDTH>1</wag:BANDWIDTH>
                                <!--Optional:-->
                                <wag:SLA/>
                            </wag:ACCESS>
                        </wag:A_END>
                        <wag:B_END>
                            <wag:LOCATION>
                                <!--Optional:-->
                                <wag:HANDOVER_NODE>string</wag:HANDOVER_NODE>
                                <!--Optional:-->
                                <wag:EIRCODE>XYZ</wag:EIRCODE>
                            </wag:LOCATION>
                            <wag:ACCESS>
                                <wag:ACTION_FLAG>CH</wag:ACTION_FLAG>
                            </wag:ACCESS>
                        </wag:B_END>
                    </wag:QUOTE_ITEM_REQUEST>
                </wag:ORDER_DATA>
            </wag:ORDER>
        </wag:QBTDC>
    </soap:Body>
</soap:Envelope>
